package com.javaex.practice;

public class Ex06 {

	public static void main(String[] args) {
		
		/* 아래의 설명중 틀린 것을 찾아서 수정해 보세요.
		  
		(1) 변수한개에는 동시에 여러 개의 값을 담을 수 있다. 
		     ==>변수 한개에는 한번에 1개만 같은 자료형의 값
		(2) 변수는 선언시에 사용한 타입의 값만 저장할 수 있다. o
		(3) 변수는 초기값이 저장되지 않아도 읽을 수 있다. x
		(4) 모든 자료형의 변수는 동일한 방식으로 저장된다. 
		    ==> 자료형에 따라 변수의 저장방식은 달라짐
		(5) double형은 flaot보다 큰 수를 담을 수 있다.o
		(6) int, float, char, String은 모두 기본자료형에 속한다 x
		    ==>(String은 기본자료형이 아닌 class이다)
		(7) final로 선언된 변수는 수정이 가능하다 x(수정불가,변경안됨)
		(8) long형은 항상 L을 붙여서 대입해야한다. (4바이트를 초과하는 경우L, 팁으로 그냥 항상 L넣기)
		(9) float형은 항상 F을 분여서 대입해야한다. o
		*/

	}

}
